Revit 2018 API
Application.OpenDocumentFile Method
Overload List
Name | Description
OpenDocumentFile(String)
 Opens a document from disk.
OpenDocumentFile(ModelPath, OpenOptions)
 Opens a document from disk.
See Also
Application Class
Application Members
Autodesk.Revit.ApplicationServices Namespace